### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_api_management_backend.psn will be updated in-place
  ~ resource "azurerm_api_management_backend" "psn" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/backends/psn-backend-01"
        name                = "psn-backend-01"
      ~ url                 = "http://psn.internal.io.pagopa.it/" -> "https://psn.internal.io.pagopa.it/"
        # (6 unchanged attributes hidden)
    }

  # azurerm_dns_a_record.api_wallet_io_pagopa_it will be created
  + resource "azurerm_dns_a_record" "api_wallet_io_pagopa_it" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "api.wallet"
      + records             = [
          + "72.146.49.243",
        ]
      + resource_group_name = "io-p-rg-external"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
      + ttl                 = 60
      + zone_name           = "io.pagopa.it"
    }

  # azurerm_dns_a_record.api_wallet_io_pagopa_it_child will be created
  + resource "azurerm_dns_a_record" "api_wallet_io_pagopa_it_child" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "api"
      + records             = [
          + "72.146.49.243",
        ]
      + resource_group_name = "io-p-rg-external"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
      + ttl                 = 60
      + zone_name           = "wallet.io.pagopa.it"
    }

  # azurerm_private_dns_a_record.api_internal_wallet_io_pagopa_it will be created
  + resource "azurerm_private_dns_a_record" "api_internal_wallet_io_pagopa_it" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "api"
      + records             = [
          + "10.20.2.119",
        ]
      + resource_group_name = "io-p-itn-wallet-rg-01"
      + ttl                 = 10
      + zone_name           = "internal.wallet.io.pagopa.it"
    }

  # azurerm_private_dns_zone.internal_wallet_io_pagopa_it will be created
  + resource "azurerm_private_dns_zone" "internal_wallet_io_pagopa_it" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "internal.wallet.io.pagopa.it"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-itn-wallet-rg-01"
      + tags                                                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }

      + soa_record (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.vnet_common_internal_wallet_io_pagopa_it will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_common_internal_wallet_io_pagopa_it" {
      + id                    = (known after apply)
      + name                  = "io-p-itn-common-vnet-01"
      + private_dns_zone_name = "internal.wallet.io.pagopa.it"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "io-p-itn-common-rg-01"
      + virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01"
    }

Plan: 5 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.storage_accounts.azurerm_storage_queue.wallet-instance-creation-email-queue-01,
  on ../_modules/storage_accounts/storage_queue.tf line 3, in resource "azurerm_storage_queue" "wallet-instance-creation-email-queue-01":
   3:   storage_account_name = azurerm_storage_account.common.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 3 more similar warnings elsewhere)
```

</details>
